
DetailsTimeLineDB = {
	["max_segments"] = 4,
	["combat_data"] = {
		{
			["date_end"] = "23:32:59",
			["date_start"] = "23:31:35",
			["name"] = "High Inquisitor Whitemane",
			["total_time"] = 84.0039999999999,
		}, -- [1]
		{
			["date_end"] = "23:30:16",
			["date_start"] = "23:29:31",
			["name"] = "Brother Korloff",
			["total_time"] = 45.0010000000002,
		}, -- [2]
		{
			["date_end"] = "23:25:11",
			["date_start"] = "23:24:21",
			["name"] = "Thalnos the Soulrender",
			["total_time"] = 50.0060000000003,
		}, -- [3]
		{
			["date_end"] = "23:22:14",
			["date_start"] = "23:21:04",
			["name"] = "Razorlash",
			["total_time"] = 70.0019999999995,
		}, -- [4]
	},
	["hide_on_combat"] = false,
	["useicons"] = false,
	["window_scale"] = 1,
	["cooldowns_timeline"] = {
		{
		}, -- [1]
		{
		}, -- [2]
		{
		}, -- [3]
		{
		}, -- [4]
	},
	["debuff_timeline"] = {
		{
			["Zånza-Ragnaros"] = {
				[9256] = {
					40.0099999999993, -- [1]
					50.0249999999996, -- [2]
					["source"] = "High Inquisitor Whitemane",
					["active"] = false,
				},
			},
			["Notadoctor-MoonGuard"] = {
				[9256] = {
					40.0099999999993, -- [1]
					50.0249999999996, -- [2]
					["source"] = "High Inquisitor Whitemane",
					["active"] = false,
				},
			},
			["Voidgøddess-Wildhammer"] = {
				[9256] = {
					40.0099999999993, -- [1]
					50.0249999999996, -- [2]
					["source"] = "High Inquisitor Whitemane",
					["active"] = false,
				},
			},
			["Korugen"] = {
				[9256] = {
					40.0099999999993, -- [1]
					50.0249999999996, -- [2]
					["source"] = "High Inquisitor Whitemane",
					["active"] = false,
				},
				[111107] = {
					46.0839999999998, -- [1]
					47.5949999999993, -- [2]
					66.6899999999996, -- [3]
					68.2039999999997, -- [4]
					["source"] = "Scarlet Judicator",
					["active"] = false,
				},
			},
			["Ninar-Malygos"] = {
				[9256] = {
					40.0099999999993, -- [1]
					50.0249999999996, -- [2]
					["source"] = "High Inquisitor Whitemane",
					["active"] = false,
				},
			},
		}, -- [1]
		{
		}, -- [2]
		{
			["Zånza-Ragnaros"] = {
				[115309] = {
					27.5250000000005, -- [1]
					29.7350000000006, -- [2]
					30.4770000000008, -- [3]
					34.1350000000002, -- [4]
					["source"] = "Evicted Soul",
					["active"] = false,
				},
				[115291] = {
					42.1370000000006, -- [1]
					49.1040000000003, -- [2]
					["source"] = "[*] Spirit Gale",
					["active"] = false,
				},
			},
			["Voidgøddess-Wildhammer"] = {
				[115297] = {
					24.4590000000007, -- [1]
					30.4770000000008, -- [2]
					["source"] = "Thalnos the Soulrender",
					["active"] = false,
				},
			},
			["Korugen"] = {
				[115291] = {
					1.11400000000049, -- [1]
					2.53100000000086, -- [2]
					13.0100000000002, -- [3]
					13.9570000000003, -- [4]
					27.5250000000005, -- [5]
					29.0840000000007, -- [6]
					29.8160000000007, -- [7]
					30.2230000000009, -- [8]
					34.7880000000005, -- [9]
					37.0190000000002, -- [10]
					42.1370000000006, -- [11]
					42.9220000000005, -- [12]
					["source"] = "[*] Spirit Gale",
					["active"] = false,
				},
			},
			["Ninar-Malygos"] = {
				[115291] = {
					15.0100000000002, -- [1]
					16.5520000000006, -- [2]
					34.7880000000005, -- [3]
					35.8230000000003, -- [4]
					["source"] = "[*] Spirit Gale",
					["active"] = false,
				},
			},
		}, -- [3]
		{
			["Korugen"] = {
				[15976] = {
					10.6419999999998, -- [1]
					20.6390000000001, -- [2]
					20.6989999999996, -- [3]
					30.701, -- [4]
					34.701, -- [5]
					44.6959999999999, -- [6]
					44.7060000000001, -- [7]
					54.7159999999994, -- [8]
					56.7479999999996, -- [9]
					66.7559999999994, -- [10]
					66.7659999999996, -- [11]
					70.0019999999995, -- [12]
					["source"] = "Razorlash",
					["active"] = false,
				},
			},
		}, -- [4]
	},
	["backdrop_color"] = {
		0, -- [1]
		0, -- [2]
		0, -- [3]
		0.4, -- [4]
	},
	["deaths_data"] = {
		{
		}, -- [1]
		{
		}, -- [2]
		{
		}, -- [3]
		{
		}, -- [4]
	},
}
