
DetailsTimeLineDB = {
	["combat_data"] = {
		{
			["date_end"] = "13:51:45",
			["date_start"] = "13:51:05",
			["name"] = "Shade of Xavius",
			["total_time"] = 40.0059999999994,
		}, -- [1]
		{
			["date_end"] = "13:49:29",
			["date_start"] = "13:48:42",
			["name"] = "Dresaron",
			["total_time"] = 47,
		}, -- [2]
		{
			["date_end"] = "13:47:27",
			["date_start"] = "13:46:47",
			["name"] = "Oakheart",
			["total_time"] = 40.0069999999996,
		}, -- [3]
		{
			["date_end"] = "13:44:10",
			["date_start"] = "13:43:34",
			["name"] = "Archdruid Glaidalis",
			["total_time"] = 36.0059999999994,
		}, -- [4]
	},
	["max_segments"] = 4,
	["cooldowns_timeline"] = {
		{
			["Amranar"] = {
				{
					18.4249999999993, -- [1]
					"Amranar", -- [2]
					22842, -- [3]
				}, -- [1]
				{
					23.2039999999997, -- [1]
					"Amranar", -- [2]
					61336, -- [3]
				}, -- [2]
			},
		}, -- [1]
		{
			["Amranar"] = {
				{
					21.5360000000001, -- [1]
					"Amranar", -- [2]
					22842, -- [3]
				}, -- [1]
				{
					43.6619999999984, -- [1]
					"Amranar", -- [2]
					22842, -- [3]
				}, -- [2]
			},
		}, -- [2]
		{
			["Amranar"] = {
				{
					23.3070000000007, -- [1]
					"Amranar", -- [2]
					22842, -- [3]
				}, -- [1]
				{
					33.6569999999992, -- [1]
					"Amranar", -- [2]
					22842, -- [3]
				}, -- [2]
				{
					37.3099999999995, -- [1]
					"Amranar", -- [2]
					22842, -- [3]
				}, -- [3]
			},
		}, -- [3]
		{
			["Amranar"] = {
				{
					17.5789999999997, -- [1]
					"Amranar", -- [2]
					22842, -- [3]
				}, -- [1]
			},
		}, -- [4]
	},
	["backdrop_color"] = {
		0, -- [1]
		0, -- [2]
		0, -- [3]
		0.4, -- [4]
	},
	["hide_on_combat"] = false,
	["debuff_timeline"] = {
		{
			["Akashiya-Zul'jin"] = {
				[200182] = {
					4.92399999999907, -- [1]
					6.83399999999892, -- [2]
					["source"] = "Shade of Xavius",
					["active"] = false,
				},
			},
			["Amranar"] = {
				[200273] = {
					10.2479999999996, -- [1]
					11.2950000000001, -- [2]
					24.8169999999991, -- [3]
					25.6659999999993, -- [4]
					36.3449999999994, -- [5]
					38.9429999999993, -- [6]
					38.9570000000003, -- [7]
					38.9570000000003, -- [8]
					["source"] = "[*] Cowardice",
					["active"] = false,
				},
				[200289] = {
					28.0650000000005, -- [1]
					31.6659999999993, -- [2]
					["source"] = "Shade of Xavius",
					["active"] = false,
				},
				[200329] = {
					31.9189999999999, -- [1]
					36.9310000000005, -- [2]
					["source"] = "Shade of Xavius",
					["active"] = false,
				},
				[200243] = {
					10.2479999999996, -- [1]
					28.0769999999993, -- [2]
					36.3449999999994, -- [3]
					38.9429999999993, -- [4]
					["source"] = "[*] Waking Nightmare",
					["active"] = false,
				},
				[200238] = {
					14.6329999999998, -- [1]
					19.5010000000002, -- [2]
					["source"] = "Shade of Xavius",
					["active"] = false,
				},
			},
			["Bolitho-Windrunner"] = {
				[200182] = {
					31.616, -- [1]
					33.0370000000003, -- [2]
					["source"] = "Shade of Xavius",
					["active"] = false,
				},
			},
		}, -- [1]
		{
			["Aeriê-Sargeras"] = {
				[220855] = {
					22.8939999999984, -- [1]
					30.893, -- [2]
					["source"] = "[*] Down Draft",
					["active"] = false,
				},
			},
			["Gorzok-Darkspear"] = {
				[220855] = {
					22.8939999999984, -- [1]
					30.9089999999997, -- [2]
					["source"] = "[*] Down Draft",
					["active"] = false,
				},
			},
			["Akashiya-Zul'jin"] = {
				[220855] = {
					22.8939999999984, -- [1]
					30.893, -- [2]
					["source"] = "[*] Down Draft",
					["active"] = false,
				},
				[199460] = {
					35.0369999999984, -- [1]
					37.7019999999993, -- [2]
					["source"] = "Dresaron",
					["active"] = false,
				},
			},
			["Amranar"] = {
				[191326] = {
					17.7929999999997, -- [1]
					25.8099999999995, -- [2]
					39.6229999999996, -- [3]
					47, -- [4]
					["source"] = "Dresaron",
					["active"] = false,
				},
				[220855] = {
					22.8939999999984, -- [1]
					30.893, -- [2]
					["source"] = "[*] Down Draft",
					["active"] = false,
				},
			},
			["Bolitho-Windrunner"] = {
				[220855] = {
					22.8939999999984, -- [1]
					30.893, -- [2]
					["source"] = "[*] Down Draft",
					["active"] = false,
				},
				[199460] = {
					35.0369999999984, -- [1]
					38.8829999999998, -- [2]
					["source"] = "Dresaron",
					["active"] = false,
				},
			},
		}, -- [2]
		{
			["Amranar"] = {
				[204667] = {
					20.8349999999991, -- [1]
					26.8379999999997, -- [2]
					["source"] = "Oakheart",
					["active"] = false,
				},
				[204611] = {
					29.723, -- [1]
					34.7360000000008, -- [2]
					["source"] = "Oakheart",
					["active"] = false,
				},
			},
		}, -- [3]
		{
			["Gorzok-Darkspear"] = {
				[196376] = {
					5.19499999999971, -- [1]
					11.8729999999996, -- [2]
					23.5130000000008, -- [3]
					23.7170000000006, -- [4]
					["source"] = "Archdruid Glaidalis",
					["active"] = false,
				},
			},
			["Amranar"] = {
				[198477] = {
					24.7170000000006, -- [1]
					32.237000000001, -- [2]
					["source"] = "Nightmare Abomination",
					["active"] = false,
				},
			},
			["Akashiya-Zul'jin"] = {
				[198408] = {
					21.3880000000008, -- [1]
					21.3880000000008, -- [2]
					["source"] = "Archdruid Glaidalis",
					["active"] = false,
				},
			},
			["Aeriê-Sargeras"] = {
				[198477] = {
					24.7170000000006, -- [1]
					32.237000000001, -- [2]
					["source"] = "Nightmare Abomination",
					["active"] = false,
				},
				[198408] = {
					29.2039999999997, -- [1]
					31.8500000000004, -- [2]
					["source"] = "Archdruid Glaidalis",
					["active"] = false,
				},
			},
			["Bolitho-Windrunner"] = {
				[198408] = {
					23.5130000000008, -- [1]
					24.7649999999994, -- [2]
					["source"] = "Archdruid Glaidalis",
					["active"] = false,
				},
			},
		}, -- [4]
	},
	["deaths_data"] = {
		{
		}, -- [1]
		{
		}, -- [2]
		{
		}, -- [3]
		{
		}, -- [4]
	},
	["window_scale"] = 1,
}
