
DetailsTimeLineDB = {
	["combat_data"] = {
		{
			["date_start"] = "23:08:49",
			["date_end"] = "23:09:49",
			["name"] = "Shade of Xavius",
			["total_time"] = 60.009,
		}, -- [1]
		{
			["date_start"] = "23:05:06",
			["date_end"] = "23:06:06",
			["name"] = "Dresaron",
			["total_time"] = 60.0069999999996,
		}, -- [2]
		{
			["date_start"] = "23:04:54",
			["date_end"] = "23:05:02",
			["name"] = "Dresaron",
			["total_time"] = 8.0010000000002,
		}, -- [3]
		{
			["date_start"] = "23:04:16",
			["date_end"] = "23:04:31",
			["name"] = "Dresaron",
			["total_time"] = 15.0010000000002,
		}, -- [4]
	},
	["max_segments"] = 4,
	["cooldowns_timeline"] = {
		{
			["Lukeydukey-Stormrage"] = {
				{
					38.7169999999987, -- [1]
					"[*] raid wide cooldown", -- [2]
					108280, -- [3]
				}, -- [1]
			},
		}, -- [1]
		{
			["Lukeydukey-Stormrage"] = {
				{
					35.4889999999996, -- [1]
					"[*] raid wide cooldown", -- [2]
					108280, -- [3]
				}, -- [1]
			},
		}, -- [2]
		{
		}, -- [3]
		{
		}, -- [4]
	},
	["backdrop_color"] = {
		0, -- [1]
		0, -- [2]
		0, -- [3]
		0.4, -- [4]
	},
	["hide_on_combat"] = false,
	["debuff_timeline"] = {
		{
			["Aldras-Arthas"] = {
				[200238] = {
					14.405999999999, -- [1]
					19.402, -- [2]
					["source"] = "Shade of Xavius",
					["active"] = false,
				},
			},
			["Spørk-AeriePeak"] = {
				[200182] = {
					4.68900000000031, -- [1]
					12.6939999999995, -- [2]
					49.5550000000003, -- [3]
					57.5679999999993, -- [4]
					["source"] = "Shade of Xavius",
					["active"] = false,
				},
			},
			["Vaempy-Aman'Thul"] = {
				[200182] = {
					28.9560000000001, -- [1]
					36.9570000000003, -- [2]
					["source"] = "Shade of Xavius",
					["active"] = false,
				},
				[200289] = {
					25.396999999999, -- [1]
					30.3429999999989, -- [2]
					["source"] = "Shade of Xavius",
					["active"] = false,
				},
				[200329] = {
					30.6049999999996, -- [1]
					35.6090000000004, -- [2]
					["source"] = "Shade of Xavius",
					["active"] = false,
				},
			},
			["Lukeydukey-Stormrage"] = {
				[200238] = {
					41.0789999999997, -- [1]
					46.0829999999987, -- [2]
					["source"] = "Shade of Xavius",
					["active"] = false,
				},
				[200289] = {
					54.4969999999994, -- [1]
					59.2860000000001, -- [2]
					["source"] = "Shade of Xavius",
					["active"] = false,
				},
			},
		}, -- [1]
		{
			["Spørk-AeriePeak"] = {
				[191326] = {
					16.3189999999995, -- [1]
					24.3150000000005, -- [2]
					37.768, -- [3]
					45.7650000000012, -- [4]
					51.5429999999997, -- [5]
					59.5210000000007, -- [6]
					["source"] = "Dresaron",
					["active"] = false,
				},
				[199460] = {
					35.3199999999997, -- [1]
					52.6080000000002, -- [2]
					["source"] = "Dresaron",
					["active"] = false,
				},
			},
			["Lukeydukey-Stormrage"] = {
				[199460] = {
					22.7049999999999, -- [1]
					25.8009999999995, -- [2]
					["source"] = "Dresaron",
					["active"] = false,
				},
			},
			["Granjior"] = {
				[199460] = {
					22.7049999999999, -- [1]
					24.2530000000006, -- [2]
					44.5320000000011, -- [3]
					46.902, -- [4]
					["source"] = "Dresaron",
					["active"] = false,
				},
			},
			["Vaempy-Aman'Thul"] = {
				[199460] = {
					22.7049999999999, -- [1]
					24.5010000000002, -- [2]
					30.6689999999999, -- [3]
					31.3989999999994, -- [4]
					44.5320000000011, -- [5]
					46.9520000000011, -- [6]
					["source"] = "Dresaron",
					["active"] = false,
				},
			},
			["Aldras-Arthas"] = {
				[199460] = {
					22.7049999999999, -- [1]
					25.0110000000004, -- [2]
					32.8389999999999, -- [3]
					35.4430000000011, -- [4]
					42.5500000000011, -- [5]
					44.5619999999999, -- [6]
					["source"] = "Dresaron",
					["active"] = false,
				},
				[191326] = {
					51.5429999999997, -- [1]
					59.5210000000007, -- [2]
					["source"] = "Dresaron",
					["active"] = false,
				},
			},
		}, -- [2]
		{
		}, -- [3]
		{
		}, -- [4]
	},
	["deaths_data"] = {
		{
		}, -- [1]
		{
		}, -- [2]
		{
		}, -- [3]
		{
		}, -- [4]
	},
	["window_scale"] = 1,
}
